## Plan Result (test_apim)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 2 to add, 1 to change, 2 to destroy.</code></pre>

* Update
  * module.api-mgmt.azurerm_api_management.apim
* Replace
  * module.api-mgmt.azurerm_api_management_custom_domain.api-management-custom-domain
  * module.api-mgmt.azurerm_role_assignment.apim




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.api-mgmt.data.azurerm_api_management.apim will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_api_management" "apim" {
      + additional_location       = (known after apply)
      + developer_portal_url      = (known after apply)
      + gateway_regional_url      = (known after apply)
      + gateway_url               = (known after apply)
      + hostname_configuration    = (known after apply)
      + id                        = (known after apply)
      + identity                  = (known after apply)
      + location                  = (known after apply)
      + management_api_url        = (known after apply)
      + name                      = "sds-api-mgmt-test"
      + notification_sender_email = (known after apply)
      + portal_url                = (known after apply)
      + private_ip_addresses      = (known after apply)
      + public_ip_address_id      = (known after apply)
      + public_ip_addresses       = (known after apply)
      + publisher_email           = (known after apply)
      + publisher_name            = (known after apply)
      + resource_group_name       = "ss-test-network-rg"
      + scm_url                   = (known after apply)
      + sku_name                  = (known after apply)
      + tenant_access             = (known after apply)
    }

  # module.api-mgmt.azurerm_api_management.apim will be updated in-place
  ~ resource "azurerm_api_management" "apim" {
        id                            = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/ss-test-network-rg/providers/Microsoft.ApiManagement/service/sds-api-mgmt-test"
        name                          = "sds-api-mgmt-test"
        tags                          = {
            "application"  = "core"
            "builtFrom"    = "hmcts/sds-azure-platform"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "Medium"
            "environment"  = "testing"
        }
        # (20 unchanged attributes hidden)

      ~ identity {
          ~ identity_ids = [
              - "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/managed-identities-test-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/pip-cp-test-mi",
            ]
          ~ type         = "SystemAssigned, UserAssigned" -> "SystemAssigned"
            # (2 unchanged attributes hidden)
        }

        # (8 unchanged blocks hidden)
    }

  # module.api-mgmt.azurerm_api_management_custom_domain.api-management-custom-domain must be replaced
-/+ resource "azurerm_api_management_custom_domain" "api-management-custom-domain" {
      ~ api_management_id = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/ss-test-network-rg/providers/Microsoft.ApiManagement/service/sds-api-mgmt-test" # forces replacement -> (known after apply) # forces replacement
      ~ id                = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/ss-test-network-rg/providers/Microsoft.ApiManagement/service/sds-api-mgmt-test/customDomains/sds-api-mgmt.test.platform.hmcts.net" -> (known after apply)

      ~ gateway {
          + certificate_source           = (known after apply)
          + certificate_status           = (known after apply)
          + expiry                       = (known after apply)
          + subject                      = (known after apply)
          + thumbprint                   = (known after apply)
            # (4 unchanged attributes hidden)
        }
      ~ gateway {
          + certificate_source           = (known after apply)
          + certificate_status           = (known after apply)
          + expiry                       = (known after apply)
          + subject                      = (known after apply)
          + thumbprint                   = (known after apply)
            # (4 unchanged attributes hidden)
        }
      ~ gateway {
          + certificate_source           = (known after apply)
          + certificate_status           = (known after apply)
          + expiry                       = (known after apply)
          + subject                      = (known after apply)
          + thumbprint                   = (known after apply)
            # (4 unchanged attributes hidden)
        }

      - timeouts {}
    }

  # module.api-mgmt.azurerm_role_assignment.apim must be replaced
-/+ resource "azurerm_role_assignment" "apim" {
      ~ id                               = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/sds-platform-test-rg/providers/Microsoft.KeyVault/vaults/acmedtssdstest/providers/Microsoft.Authorization/roleAssignments/646016e4-f110-0e0f-03d5-7148215ef195" -> (known after apply)
      ~ name                             = "646016e4-f110-0e0f-03d5-7148215ef195" -> (known after apply)
      ~ principal_id                     = "e5f39366-8b7a-475b-9be5-3cf20f135f71" # forces replacement -> (known after apply) # forces replacement
      ~ principal_type                   = "ServicePrincipal" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/providers/Microsoft.Authorization/roleDefinitions/4633458b-17de-408a-b874-0445c86b69e6" -> (known after apply)
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

Plan: 2 to add, 1 to change, 2 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":574,"Program":"tfcmt","SHA1":"","Target":"test_apim","Vars":{}} -->